import React from "react";

const About = () => {
  return (
    <div className="bg-primary text-white p-10 rounded-2xl shadow-xl w-auto max-w-4xl mx-auto my-12">
      <h1 className="text-5xl text-white font-extrabold text-center mb-6">אודות</h1>
      <strong className='about-string'>ברוכים הבאים למציאון</strong>
      <p className="about-p">
        מציאון היא פלטפורמה ייחודית שמחברת בין אנשים שאיבדו חפצים לבין אלו שמצאו אותם, במטרה ליצור קהילה שמקדמת ערכים של תרומה לחברה ועזרה הדדית, תוך קיום השבת אבידה כהלכתה.
        בישראל, חפצים רבים הולכים לאיבוד מדי יום – בין אם מדובר בתיקים, מפתחות, טלפונים, תכשיטים או כל פריט אחר. מצד שני, אנשים רבים מוצאים חפצים אבודים אך אינם יודעים כיצד לאתר את בעליהם. האתר שלנו מציע פתרון פשוט ויעיל: חיבור בין המאבד למוצא, בצורה מאובטחת, המבוססת על ההלכה היהודית.</p>
      <strong className='about-string'>אז איך זה עובד?</strong>
      <p className="about-p"> 
        אדם שאיבד חפץ יכול להעלות דיווח הכולל פרטים מדויקים על החפץ: סוג, צבע, מיקום משוער.
        לעומתו, אדם שמצא חפץ אבוד יכול להעלות דיווח על המציאה, לציין תיאור מפורט, ולהוסיף שאלות שמהוות סימנים הלכתיים לאימות הבעלות.</p>
      <p className="about-p">
        המערכת שלנו משווה בין דיווחי האבידות לדיווחי המציאות ומציעה התאמות פוטנציאליות.
        כשמתבצעת התאמה, נשלחים למאבד ולמוצא דיווחים (באימייל, בהודעה קולית לטלפון, ובהתראות האתר) על סיכוי להשבת האבידה.</p>
      <p className="about-p">
        בתהליך הדיווח, על המאבד לענות על השאלות שמהוות סימנים לאבידה, אותן כתב המוצא, ורק אם ענה על כולן נכונה, יהיה יכול המוצא להעביר את הפריט למאבד בבטחה.
        תיאום העברת הפריט ייעשה בצורה מאובטחת על ידי התכתבות בצ&apos;אט האתר, ושיתוף פרטי הקשר במקרה הצורך.</p>
      <strong className='about-string'>החזון שלנו</strong>
      <p className="about-p">
        אנו מאמינים שהשבת אבידה היא דרך לחזק את תחושת הקהילה והאמון בין אנשים. האתר שלנו נועד לספק פתרון פשוט ויעיל למי שאיבד או מצא חפץ, תוך הקפדה על ערכים של יושרה, שקיפות ושיתוף פעולה.
        הצטרפו אלינו ועזרו להחזיר חפצים לבעליהם בצורה קלה ובטוחה.
      </p>
      <strong className='about-string'>צוות אתר מציאון.</strong>
    </div>
  );
};

export default About;